def area(a):
    '''Возвращает площадь квадрата по длине его стороны (a)

        Параметры:
            a (float): длина стороны квадрата

        Возвращаемое значение:
            (float): площадь квадрата
    '''
    return a * a

    '''Пример вызовы
    area(4)     16.0
    area(2.5)   6.25
    '''

def perimeter(a):
    '''Возвращает периметр квадрата по длине его стороны (a)

        Параметры:
            a (float): длина стороны квадрата

        Возвращаемое значение:
            (float): периметр квадрата
    '''
    return 4 * a

    '''Пример вызовы
    perimeter(4)    16.0
    perimeter(2.5)  10.0
    '''
